Конфигурация/BusinessProcesses/ЗачислениеПаев.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<BusinessProcess>
		<Properties>
			<Name>ЗачислениеПаев</Name>
			<Task>Task.ЗадачаИсполнителя</Task>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаявкаПайщика</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаПайщика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пайщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВводДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВводДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветОВозможностиЗачисленияПаев</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыОтветаНаЗаявкуПайщикаОЗачисленииПаев</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерОтчетаОВозможностиЗачисленияПаев</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</BusinessProcess>
</MetaDataObject>

Конфигурация/Documents/ЗачислениеПаев.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ЗачислениеПаев</Name>
			<BasedOn>
				<xr:Item>Document.ПереводДенежныхСредств</xr:Item>
				<xr:Item>Document.ЗаявкаПайщика</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗадолженностиПоДенежнымСредствам</xr:Item>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
				<xr:Item>AccumulationRegister.ДолиПайщиковВИнвестиционномФонде</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаевойИнвестиционныйФонд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПаевыеИнвестиционныеФонды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пайщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаПайщика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоступлениеДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПереводДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНадбавки</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/BusinessProcesses/ЗачислениеПаев/Ext/ObjectModule.bsl
Процедура ЗагрузкаООВПиОНВППриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	
	Обработки.ОбменДаннымиСДКРегион.ЗагрузитьДанныеОтДКРегион(
		ЭтотОбъект.Организация,
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Задача, "Основание.Дата"),
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.ЗаявкаПайщика, "ПаевойИнвестиционныйФонд"),
		Задача,
		Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	РеквизитыЗадачи = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Задача, "ОтветОВозможностиЗачисленияПаев, НомерОтчетаОВозможностиЗачисленияПаев");
	
	Если Не ЗначениеЗаполнено(РеквизитыЗадачи.ОтветОВозможностиЗачисленияПаев) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	
	ЭтотОбъект.ОтветОВозможностиЗачисленияПаев			= РеквизитыЗадачи.ОтветОВозможностиЗачисленияПаев;
	ЭтотОбъект.НомерОтчетаОВозможностиЗачисленияПаев	= РеквизитыЗадачи.НомерОтчетаОВозможностиЗачисленияПаев;
	
	ЭтотОбъект.Записать();
	
КонецПроцедуры

Процедура ПолученОтчетОВыдачеПаевПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	Результат = ЭтотОбъект.ОтветОВозможностиЗачисленияПаев = Перечисления.ВариантыОтветаНаЗаявкуПайщикаОЗачисленииПаев.ПолученОтчетОВозможностиВыдачиПаев;
	
	//##Для отрицательного результата добавить оповещение о необходимости вернуть денежные средства пайщику
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) <> Тип("ДокументСсылка.ВводДенежныхСредств") Тогда
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
	
	ЭтотОбъект.Дата					= ТекущаяДатаСеанса();
	ЭтотОбъект.ВводДенежныхСредств	= ДанныеЗаполнения;
	
	РеквизитыОснования				= ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеЗаполнения, "Организация, Основание");
	ЭтотОбъект.Организация			= РеквизитыОснования.Организация;
	ЭтотОбъект.ЗаявкаПайщика		= РеквизитыОснования.Основание;
	ЭтотОбъект.Пайщик				= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.ЗаявкаПайщика, "Пайщик");
	
КонецПроцедуры

Процедура ЗаполнитьРеквизитыЗадачи(ФормируемыеЗадачи, ИмяГруппыИсполнителей)
		
	ГруппаИсполнителей = Справочники.ГруппыПользователей.ПолучитьГруппуИсполнителей(ОбщегоНазначения.ПолучитьИменованныйОбъект(ИмяГруппыИсполнителей), ЭтотОбъект.Организация);
		
	Для Каждого Задача Из ФормируемыеЗадачи Цикл		
		
		Задача.ГруппаИсполнителей = ГруппаИсполнителей;
		Задача.Основание 		  = ЭтотОбъект.ВводДенежныхСредств;
		Задача.Организация		  = ЭтотОбъект.Организация;		
				
	КонецЦикла;
	  			
КонецПроцедуры

Процедура ОтправкаВДКВыпискиСПоступлениямиНаТранзитныйСчетПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	ЗаполнитьРеквизитыЗадачи(ФормируемыеЗадачи, "БэкОфис");
	
КонецПроцедуры

Процедура ОтправкаВЛККДанныхОПоступленииДенежныхСредствНаТранзитныйСчетПИФПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	ЗаполнитьРеквизитыЗадачи(ФормируемыеЗадачи, "СистемныеПользователи");
	
КонецПроцедуры

Процедура ЗагрузкаООВПиОНВППриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	ЗаполнитьРеквизитыЗадачи(ФормируемыеЗадачи, "СистемныеПользователи");
	
КонецПроцедуры

Процедура ОтправкаВыпискиСПоступлениямиНаРасчетныйСчетСТранзитногоПИФВДКПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	ЗаполнитьРеквизитыЗадачи(ФормируемыеЗадачи, "БэкОфис");
	
КонецПроцедуры

Процедура ОтправкаДанныхВЛККОПереводеСТранзитногоСчетаПИФНаРасчетныйПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	ЗаполнитьРеквизитыЗадачи(ФормируемыеЗадачи, "СистемныеПользователи");
	
КонецПроцедуры

Процедура ЗагрузкаДанныхОтДКПоЗачислениюПаевПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	ЗаполнитьРеквизитыЗадачи(ФормируемыеЗадачи, "СистемныеПользователи");
	
КонецПроцедуры

Процедура ОтправкаВЛККДанныхОЗачисленииПаевПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	ЗаполнитьРеквизитыЗадачи(ФормируемыеЗадачи, "СистемныеПользователи");
	
КонецПроцедуры

Процедура ЗагрузкаДанныхОтДКПоЗачислениюПаевПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	
	Обработки.ОбменДаннымиСДКРегион.ЗагрузитьДанныеОтДКРегион(
		ЭтотОбъект.Организация,
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Задача, "Основание.Дата"),
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.ЗаявкаПайщика, "ПаевойИнвестиционныйФонд"),
		Задача,
		Отказ);
		
КонецПроцедуры

Процедура ОтправкаВЛККДанныхОПоступленииДенежныхСредствНаТранзитныйСчетПИФПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	
	ОбменСЛКК = Обработки.ОбменДаннымиСЛККЕСИАФинанс.Создать(); 
	
	ОбменСЛКК.Организация	= ЭтотОбъект.Организация;
	ОбменСЛКК.Пиф			= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.ЗаявкаПайщика, "ПаевойИнвестиционныйФонд");
	
	ОбменСЛКК.ДополнительныеСвойства.Вставить("Источник", ЭтотОбъект.Ссылка);
	ОбменСЛКК.ВыгрузитьВводыДенежныхСредств(ЭтотОбъект.ВводДенежныхСредств, Отказ);
	
КонецПроцедуры

Процедура ОтправкаВЛККДанныхОЗачисленииПаевПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	
	// Ищем зачисление паев и передаем в обработку обмена с ЛКК
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДокументЗачислениеПаев.Ссылка КАК Ссылка,
		|	ПроцессЗачислениеПаев.НомерОтчетаОВозможностиЗачисленияПаев КАК НомерООВП
		|ИЗ
		|	БизнесПроцесс.ЗачислениеПаев КАК ПроцессЗачислениеПаев
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗачислениеПаев КАК ДокументЗачислениеПаев
		|		ПО (ДокументЗачислениеПаев.Организация = ПроцессЗачислениеПаев.Организация)
		|			И (ДокументЗачислениеПаев.Заявка = ПроцессЗачислениеПаев.ЗаявкаПайщика)
		|			И (ДокументЗачислениеПаев.ПоступлениеДенежныхСредств.СтрокаБанковскойВыписки.НазначениеПлатежа ПОДОБНО ""%"" + ПроцессЗачислениеПаев.НомерОтчетаОВозможностиЗачисленияПаев + ""%"")
		|ГДЕ
		|	ПроцессЗачислениеПаев.Ссылка = &ПроцессЗачисленияПаев");
	
	Запрос.УстановитьПараметр("ПроцессЗачисленияПаев", ЭтотОбъект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() <> 1 Тогда
		
		//##Обработать ошибку
		Отказ = Истина;
		Возврат;
		
	КонецЕсли;
	
	Выборка.Следующий();
	
	//Проверяем прикрепленные файлы (нужны pdf и sig)	
	ПрикрепленныеФайлы = РаботаСФайловымХранилищем.ПолучитьСписокФайлов(Выборка.Ссылка);
	
	Если ПрикрепленныеФайлы.Количество() = 0 Тогда
		//##Зарегистрировать ошибку
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ОбменСЛКК = Обработки.ОбменДаннымиСЛККЕСИАФинанс.Создать(); 
		
	ОбменСЛКК.Организация	= ЭтотОбъект.Организация;
	ОбменСЛКК.Пиф			= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.ЗаявкаПайщика, "ПаевойИнвестиционныйФонд");
	
	ОбменСЛКК.ДополнительныеСвойства.Вставить("Источник", ЭтотОбъект.Ссылка);
	
	ЕстьФайлы = Ложь;
	Для Каждого ПрикрепленныйФайл Из ПрикрепленныеФайлы Цикл
			
		Если СтрНачинаетсяС(ПрикрепленныйФайл.Наименование, "Уведомление об операции по лицевому счету")
			И (ПрикрепленныйФайл.Расширение = "pdf"
				Или ПрикрепленныйФайл.Расширение = "sig") Тогда
			ФайлУведомления = РаботаСФайловымХранилищем.ПолучитьФайл(ПрикрепленныйФайл.ИдентификаторФайла);
			ОбменСЛКК.ВыгрузитьФайлы(ЭтотОбъект.ЗаявкаПайщика,
						ФайлУведомления.Адрес,
						ПрикрепленныйФайл.Наименование + "." + ПрикрепленныйФайл.Расширение,
						ПрикрепленныйФайл.Наименование,
						Отказ);
			ЕстьФайлы = Истина;			
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не ЕстьФайлы Тогда
		//##Зарегистрировать ошибку
		Отказ = Истина;
		Возврат;
	КонецЕсли;
		
	ОбменСЛКК.ВыгрузитьОперацииПоПаям(Выборка.Ссылка, Выборка.НомерООВП, Отказ);
		
КонецПроцедуры

Процедура ЭкспортДанныхОПоступленииДенежныхСредствВПервуюФормуМКБПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	ЗаполнитьРеквизитыЗадачи(ФормируемыеЗадачи, "СистемныеПользователи");
	
КонецПроцедуры

Процедура ЭкспортДанныхОЗачисленииПаевВПервуюФормуМКБПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	ЗаполнитьРеквизитыЗадачи(ФормируемыеЗадачи, "СистемныеПользователи");
	
КонецПроцедуры

Процедура ЭкспортДанныхОПоступленииДенежныхСредствВПервуюФормуМКБПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	
	ОбработкаЭкспорта = Обработки.ЭкспортДанныхВПервуюФормуКоллЦентра.Создать();
		
	ОбработкаЭкспорта.ДополнительныеСвойства.Вставить("Источник", ЭтотОбъект.Ссылка);
	ОбработкаЭкспорта.ЭкспортироватьДвижениеАктивов(ЭтотОбъект.Организация, ЭтотОбъект.ЗаявкаПайщика, Отказ);
	
КонецПроцедуры

Процедура ЭкспортДанныхОЗачисленииПаевВПервуюФормуМКБПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	
	ОбработкаЭкспорта = Обработки.ЭкспортДанныхВПервуюФормуКоллЦентра.Создать(); 
	
	ОбработкаЭкспорта.ДополнительныеСвойства.Вставить("Источник", ЭтотОбъект.Ссылка);
	ОбработкаЭкспорта.ЭкспортироватьДвижениеАктивов(ЭтотОбъект.Организация, ЭтотОбъект.ЗаявкаПайщика, Отказ);

КонецПроцедуры

Процедура ФормированиеПереводаДССТранзитногоСчетаНаРасчетныйПриЗагрузкеВыпискиПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	ЗаполнитьРеквизитыЗадачи(ФормируемыеЗадачи, "СистемныеПользователи");
	
КонецПроцедуры

Процедура ФормированиеВыводаДенежныхСредствПайщикуПриЗагрузкеВыпискиПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	ЗаполнитьРеквизитыЗадачи(ФормируемыеЗадачи, "СистемныеПользователи");
	
КонецПроцедуры
